/**
 * @file error-code-messages 相关
 */

export const helpWords = '请稍后再试'

export default {
  0: '未知错误',

  // base
  301: '需要重定向',

  400: '请求参数错误',
  401: '未登录，请重新登录',
  403: '没有权限',
  404: '资源不存在',
  409: '资源冲突/重复',
  429: '请求次数过多',
  500: '请求失败',
  502: '服务器开小差了',
  503: '服务不可用',
  598: '获取数据出错',
  599: '非法请求'
}

// sso
// copy from https://github.com/qbox/sso/blob/develop/src/sso.qiniu.com/app/static/asserts/js/base.js#L1
export const ssoErrCodeMsgMap = {
  7011: '验证失败，请重新输入',
  7012: '请输入验证码',
  7013: '尝试次数过多，请 5 分钟后再试',
  7014: '用户名或者密码错误',
  7015: '需要两步验证',
  7016: '需要手机两步验证',
  7017: '登录失败，请提交工单',
  7018: '凭证无效',
  7019: '非法请求',
  7021: '登录过期，请重新登录',
  7022: '两步验证码输入有误',
  7023: '验证信息发送失败',
  7024: '生成验证码超过数量限制，请 5 分钟后再试',
  7025: '发送短信超过数量限制，请 5 分钟后再试',
  7026: '生成验证码失败，请重试',
  7028: '查询账号列表失败',
  7036: '注册失败',
  7040: '需要安全合规验证',
  7041: '安全合规验证失败',
  7042: '无效的微信授权 phone code',
  7400: '无效的 code',
  29189: '无效手机号',
  29952: '手机号重复',
  29186: '手机号黑名单',
  29187: 'ip 黑名单',
  73988: 'wx code 无效',
  73989: 'wx code 已被使用',
  28928: '用户名密码错误',
  28929: '账号已锁定，密码错误次数过多',
  28930: '第三方账号与 UID 无绑定关系',
  30208: '账号绑定失败',
  30209: '账号已绑定',
  30210: '账号已被其他第三方账号绑定'
}

export const ucBizErrCodeMsgMap = {
  5: '二维码无效',
  73986: '二维码状态非法更新',
  73987: '二维码状态重复更新',
  73984: '二维码状态已失效',
  73988: 'wx code 已失效',
  73989: 'wx code 已使用',
  73985: '二维码已被使用',
  73991: 'wx phone code 已失效',
  73990: '二维码未被扫码'
}

export const WxPayEnvConflictErrCode = 7739
